/**
 * [ CharacterType ]: นฎภฺ ภิทยวฯฟฉ นฎภฺ มพท๙ ฦวบฐวฯฟฉ รโทย
 *  
 *   o วมทฮฑืทกนึ ฝบลธภฯ 
 *     1) main() ธÞผาตๅทฮธธ ลฌทกฝบ ฑธผบ
 *     2) นฎภฺ ภิทยวฯฐํ ม฿รธตศ if นฎ ป็ฟ๋วฯฟฉ นฎภฺ มพท๙ ฦวบฐวิ
 *        
 *   o ฦวบฐวา นฎภฺ มพท๙
 *     - ฟตพ๎ ด๋นฎภฺ ภฺภฝ, ธ๐ภฝ
 *     - ฟตพ๎ ผานฎภฺ ภฺภฝ, ธ๐ภฝ
 *     - ผýภฺ ต๐ม๖ฦฎ
 *     - วัฑÛ ภฺภฝ, ธ๐ภฝ, วัฑÛ ฑÛภฺ
 *     - ฑโลธ นฎภฺ
 *      
 *   o ม฿รธตศ if นฎ ป็ฟ๋วฯฟฉ นฎภฺ มพท๙ ฦวดÜวฯฐํ ฐแฐ๚ รโทย   
 *    
 *   o นฎภฺ บฏผ๖ฟก นฎภฺ ภิทย
 *     - SkScanner.getCharWithPrompt(วมทาวมฦฎ_นฎภฺฟญ): 
 *           วมทาวมฦฎ นฎภฺฟญ รโทยวั ศฤ นฎภฺ วฯณช ภิทยวฯดย ธÞผาตๅ
 *           
 *     - char c = SkScanner.getCharWithPrompt("  * มพท๙ ศฎภฮวา นฎภฺ > ");
 */

class Ex4_2_4_CharacterType_UsingIf {
	public static void main(String[] args) {
		// นฎภฺ มพท๙บฐ ธํฤช ภ๚ภๅวฯดย นฎภฺฟญ น่ฟญ
		String[] ctypeNames = { "ฟตด๋นฎภฺ ธ๐ภฝ", "ฟตด๋นฎภฺ ภฺภฝ", 
		                    	"ฟตผานฎภฺ ธ๐ภฝ", "ฟตผานฎภฺ ภฺภฝ",
		                    	"วัฑÛ ภฺภฝ", "วัฑÛ ธ๐ภฝ", "วัฑÛ ฑÛภฺ",
		                    	"ผýภฺ ต๐ม๖ฦฎ",
		                    	"ฑโลธ นฎภฺ"
		};

		System.out.println("\n  ** นฎภฺ มพท๙ ศฎภฮวฯฑโ **\n");
	
    	char c = SkScanner.getCharWithPrompt("  o มพท๙ ศฎภฮวา นฎภฺ > ");
	
    	int ctype;  // 0บฮลอ 8ฑ๎ม๖ นฎภฺ มพท๙ ณชลธณปดย น๘ศฃ ภ๚ภๅวา บฏผ๖

		// ม฿รธตศ if นฎภว ฟน: นฎภฺ มพท๙ ศฎภฮวฯฟฉ ctypeฟก มพท๙ น๘ศฃ ภ๚ภๅ
		if (c >= 'A' && c <= 'Z') {           // 'A'บฮลอ 'Z'ฑ๎ม๖ดย ฟตด๋นฎภฺ
 			if (c=='A' || c=='E' || c=='I' || c=='O' || c=='U')  
				ctype = 0;                    //    ฟตด๋นฎภฺ ธ๐ภฝภว มพท๙ น๘ศฃ: 0
			else
				ctype = 1;                    //    ฟตด๋นฎภฺ ภฺภฝภว มพท๙ น๘ศฃ: 1
		} else if (c >= 'a' && c <= 'z') {    // 'a'บฮลอ 'z'ฑ๎ม๖ดย ฟตผานฎภฺ
 			if (c=='a' || c=='e' || c=='i' || c=='o' || c=='u')  
				ctype = 2;                    //    ฟตผานฎภฺ ธ๐ภฝภว มพท๙ น๘ศฃ: 2
			else
				ctype = 3;                    //    ฟตผานฎภฺ ภฺภฝภว มพท๙ น๘ศฃ: 3
		} else if (c >= 'คก' && c <= 'คพ')     // 'คก'ภบ วัฑÛ ภฺภฝ ม฿ รึผา, 'คพ'ภบ รึด๋
			ctype = 4;	                      //     วัฑÛ ภฺภฝภว มพท๙ น๘ศฃ: 4
		else if (c >= 'คฟ' && c <= 'คำ')       // 'คฟ'ดย วัฑÛ ธ๐ภฝ ม฿ รึผา, 'คำ'ดย รึด๋
			ctype = 5;	                      //     วัฑÛ ธ๐ภฝภว มพท๙ น๘ศฃ: 6 
		else if (c >= 'ฐก' && c <= 'ฦR')       // 'ฐก'ดย วัฑÛ ฑÛภฺ ม฿ รึผา, 'ฦR'ภบ รึด๋
			ctype = 6;	                      //     วัฑÛ ฑÛภฺภว มพท๙ น๘ศฃ: 6  
		else if (c >= '0' && c <= '9')        // '0'บฮลอ '9'ฑ๎ม๖ดย ต๐ม๖ฦฎ
			ctype = 7;                        //     ผýภฺ ต๐ม๖ฦฎภว มพท๙ น๘ศฃ: 7 
		else 
			ctype = 8;                        //     ฑโลธ นฎภฺ มพท๙ภว น๘ศฃ: 8 

		System.out.println("  * ภิทย นฎภฺ '" + c + "'(มคผ๖ฐช: " + (int) c +")ภว มพท๙: "	+ ctypeNames[ctype]);	
		
		SkScanner.getChar(); SkScanner.getChar();  // !! ฟฃลอลฐธฆ ดญทถภป ถง ภิทยตวดย นฎภฺธฆ มฆฐลวฯฑโ ภงวุ รทฐกตศ นฎภๅต้
		
		main(args);  // main() ธÞผาตๅ นÝบนวุ ผ๖วเฝรลฐดย ฐกภๅ ฝฌฟ๎ นๆนý(ฒภ พหพฦตั ฐอ!!!!!!)
	}
}

/*
 * [ วมทฮฑืทฅภว ภฬวุ นื ฝววเ ]
 * 
 *   1) มึพ๎ม๘ วมทฮฑืทฅ ป์ฦ์บธฐํ วมทฮฑืทฅภว ณปฟ๋ ฦฤพววฯถ๓.     
 *      - น่ฟญบฏผ๖ ctypeNamesฟก นฎภฺ มพท๙ ภฬธงต้ ภ๚ภๅ
 *      
 *      - << c = SkScanner.getCharWithPrompt("  * มพท๙ ศฎภฮวา นฎภฺ > "); >>ธฆ ภฬฟ๋วฯฟฉ  นฎภฺ บฏผ๖ cฟก นฎภฺ ภิทย
 *      
 *      - นฎภฺ บฏผ๖ cฟก ภิทยตศ นฎภฺ มพท๙ ศฎภฮวฯฟฉ ctypeฟก 0บฮลอ 8ฑ๎ม๖ มพท๙ธฆ ณชลธณปดย น๘ศฃ ภ๚ภๅ
 *        (ฟตด๋นฎภฺ ภฺภฝ: 0, ... , ฑโลธ นฎภฺ: 8)
 *        
 *      - ctypeภป ภฮตฆฝบทฮ ป็ฟ๋วฯฟฉ ctypeNames น่ฟญฟกผญภว นฎภฺ มพท๙ ภฬธง ฑธวฯฐํ รโทยวิ
 *      
 *      - << (int) c >>ฟกผญ นฎภฺบฏผ๖ cธฆ int ลธภิภธทฮ บฏศฏวฯฟฉ รโทยวฯธ้ ภฏดฯฤฺตๅ นฎภฺฟก ด๋วั มคผ๖ฐช รโทย
 *      
 *   2) 'A', 'B', 'o', 'd', 'คฉ', 'คว', 'ศซ', '8', '$' ภิทยวฯฟฉ ฐแฐ๚ ศฎภฮวฯถ๓.
 *   
 *  
 * [ ยüฐํป็วื ]
 * 
 *   1) << SkScanner.getChar(); SkScanner.getChar(); >>ธฆ << main(args); >> ภงฟก ภÛผบวั ภฬภฏดย ดูภฝฐ๚ ฐฐดู.
 *     --------------------------------------------------------------------
 *      ภฬ วมทฮฑืทฅ ผ๖วเฝรลฐฐํ นฎภฺ วฯธฆ ภิทยวั ศฤ ฟฃลอลฐ ดฉธฃธ้ ภิทยวั นฎภฺ ปำ พฦดฯถ๓ 
 *      ฟฃลอลฐฟก วุด็ตวดย มคผ๖ฐชภฬ 13ภฮ ธฎลฯ(carriage return) นฎภฺฟอ 
 *      มคผ๖ฐชภฬ 10ภฮ มูนูฒÞ(newline) นฎภฺฐก ภิทยตวพ๎ วมทฮฑืทฅภธทฮ ภüดÞตวฑโ ถงนฎภฬดู.
 *      
 *      ภฬต้ นฎภฺดย ดซฟก บธภฬม๖ดย พสม๖ธธ ภิทยตวดย นฎภฺภฬนวทฮ ภฬต้ภป มฆฐลวฯฑโ ภงวุ 
 *      << SkScanner.getChar(); SkScanner.getChar(); >>ธฆ << main(args); >> ภงฟก ภÛผบวัดู.
 *      
 *   2) วัฒจน๘ฟก ฟฉทฏ นฎภฺต้ภป ภิทยวฯฐํ ฟฃลอลฐธฆ ดฉธฃฐิตวธ้ ภิทยตศ นฎภฺต้ภว นฎภฺ มพท๙ฐก 
 *      ฟฌผำภ๛ภธทฮ รโทยตศดู. ฑืทฑตฅ ภิทยตศ นฎภฺ ม฿ 2น๘ยฐ, 3น๘ยฐ, 5น๘ยฐ, 6น๘ยฐ, 8น๘ยฐ, 9น๘ยฐ ต๎ภว นฎภฺดย 
 *      << SkScanner.getChar(); SkScanner.getChar(); >>ฟก ภววุ มฆฐลตวนวทฮ นฎภฺ มพท๙ฐก ฑธวุม๖ม๖ พสดยดู.
 *      
 *   3) SkScanner.getChar()ดย นฎภฺ วฯณชธฆ ภิทยวฯดย ธÞผาตๅภฬม๖ธธ ภิทยตศ นฎภฺต้ภบ ฟฃลอลฐฐก ดญทฏม๚ ถงฑ๎ม๖ดย 
 *      ภิทยนฎภฺฐก วมทฮฑืทฅภธทฮ ภüดÞตวม๖ พสดยดู.    
 *      
 *      ฑื ภฬภฏดย ฟฃลอลฐฐก ดญทฏม๚ ถงฑ๎ม๖ ภิทยภฬ นฬท็พ๎ม๖ตตทฯ ภิทย นๆฝฤภฬ ผณมคตวพ๎ ภึฑโ ถงนฎภฬดู.   
 */
