package practice10;

import java.io.*;  // FileReader Å¬·¡½º¸¦ »ç¿ëÇÏ±â À§ÇØ import

/**
 * [ 10Àå ½Ç½À°úÁ¦ 6 ¸ð¹ü ´ä¾È ]: 
 *     FileReader¸¦ ÀÌ¿ëÇÏ¿© file¿¡¼­ ¹®ÀÚ ÀÐ¾î ¹®ÀÚ Á¾·ùº° °³¼ö ±¸ÇÏ±â
 *         
 *   6. ÆÄÀÏ¿¡¼­ ¹®ÀÚ ÀÐ¾î Á¾·ùº° °³¼ö Ãâ·ÂÇÏ±â
 *       
 *     java.io.FileReader Å¬·¡½ºÀÇ int read() ¸Þ¼Òµå¸¦ ÀÌ¿ëÇÏ¿© 
 *     "java.txt" ÆÄÀÏÀÇ µ¥ÀÌÅÍ¸¦ ¹®ÀÚ ´ÜÀ§·Î ÀÐ¾î ¹®ÀÚÀÇ Á¾·ùº° °³¼ö¸¦ ±¸ÇØ 
 *     Ãâ·ÂÇÏ´Â ÇÁ·Î±×·¥À» ÀÛ¼ºÇÏ¶ó.
 *       
 *     ¹®ÀÚÀÇ Á¾·ù´Â ¿µ¾î ´ë¹®ÀÚ ¸ðÀ½, ¿µ¾î ´ë¹®ÀÚ ÀÚÀ½, ¿µ¾î ¼Ò¹®ÀÚ ¸ðÀ½, ¿µ¾î ¼Ò¹®ÀÚ ÀÚÀ½, 
 *     ÇÑ±Û ¹®ÀÚ, Æ¯¼ö¹®ÀÚ, ±âÅ¸¹®ÀÚ µîÀ¸·Î ÇÏ¸ç, º¯¼ö c¿¡ ÀúÀåµÈ ¹®ÀÚ°¡ ÇÑ±Û ¹®ÀÚÀÎ°¡¸¦ °Ë»çÇÏ´Â Á¶°ÇÀº 
 *     (c >= '¤¡' && c <= '¤¾' || c >= '¤¿' && c <= '¤Ó' || c >= '°¡' && c <= 'ÆR') ÀÌ´Ù. 
 *  
 *   o java.io ÆÐÅ°ÁöÀÇ FileReader
 *     - ÆÄÀÏ¿¡¼­ ¹®ÀÚ µ¥ÀÌÅÍ ÀÐ°ÔÇÏ´Â Å¬·¡½º
 *     - »ó´ë°æ·Î·Î ÀÐÀ» °æ¿ì ÆÄÀÏÀº ÇÁ·ÎÁ§Æ® Æú´õ¿¡ ÀúÀåµÇ¾î¾ß ÇÔ
 *     - ±×·¯¹Ç·Î ÀÐÀ» ÆÄÀÏ "java.txt" ÆÄÀÏÀº ÇÁ·ÎÁ§Æ® ch10ÀÌ ÀúÀåµÇ´Â ch10 Æú´õ ¾Æ·¡¿¡ ÀúÀåµÊ
 *    
 *     - int read() ¸Þ¼Òµå: ÇÑ ¹®ÀÚ µ¥ÀÌÅÍ¸¦ °´Ã¼ »ý¼ºÀÚ¿¡ ¸í½ÃµÈ ÆÄÀÏ¿¡¼­ ÀÐ¾î µéÀÌ¸ç, 
 *                         ´õ ÀÌ»ó ÀÐÀ» ¹®ÀÚ°¡ ¾øÀ¸¸é -1À» ¹ÝÈ¯
 *                         (¹®ÀÚ¸¦ ÀÐÁö¸¸ ¹ÝÈ¯°ª Å¸ÀÔÀº intÀÓ ²À ±â¾ïÇÒ °Í)
 *                         
 *     - close() ¸Þ¼Òµå: ÀÛ¾÷ÀÌ ³¡³ª ÆÄÀÏÀ» ´õ ÀÌ»ó »ç¿ëÇÏÁö ¾ÊÀ» °æ¿ì È£ÃâÇÏ¸ç, 
 *                      ÀÔ·ÂÀ» À§ÇØ ÇÒ´çµÈ ÀÚ¿øµéÀÌ ¸ðµÎ È¸¼ö
 */

public class Practice10_6_CountCharTypeUsingFileReader {
	// ¹®ÀÚ Á¾·ùº° ¸íÄªÀ» ÀúÀåÇÏ´Â ¹®ÀÚ¿­ ¹è¿­
	static String[] ctypeNames = { 
			"¿µ´ë¹®ÀÚ ¸ðÀ½", "¿µ´ë¹®ÀÚ ÀÚÀ½", 
			"¿µ¼Ò¹®ÀÚ ¸ðÀ½", "¿µ¼Ò¹®ÀÚ ÀÚÀ½",
			"ÇÑ±Û ÀÚÀ½", "ÇÑ±Û ¸ðÀ½", "ÇÑ±Û ±ÛÀÚ",
			"¼ýÀÚ µðÁöÆ®",
			"±âÅ¸ ¹®ÀÚ"
	};
	
	public static void main(String[] args) {
		
		// "java.txt" ÆÄÀÏÀÇ µ¥ÀÌÅÍ ÀÐ¾î ¹®ÀÚ Á¾·ùº° °³¼ö Ãâ·Â
		int[] countCharTypes = getCountOfCharTypes("java.txt");
		
		outputCountCharTypes(countCharTypes);
	}

	// filename ÆÄÀÏÀÇ µ¥ÀÌÅÍ¸¦ ¹®ÀÚ ´ÜÀ§·Î ÀÐ¾î ¹®ÀÚ Á¾·ùº° °³¼ö Ãâ·ÂÇÏ´Â ¸Þ¼Òµå
	static int[] getCountOfCharTypes(String filename) {   
		
		// ¹®ÀÚ Á¾·ùº° °³¼ö¸¦ ÀúÀåÇÒ ¹è¿­º¯¼ö
		int[] countCharTypes = new int[ctypeNames.length];
		
		// °´Ã¼ »ý¼ºÀÚ, read(), close() ¸Þ¼Òµå´Â ¿¹¿Ü¸¦ ¹ß»ýÇÏ¹Ç·Î try-catch ºí·ÏÀ¸·Î ¿¹¿Ü Ã³¸®
		try {
			// filename ÆÄÀÏ¿¡ ´ëÇÑ FileReader °´Ã¼ »ý¼ºÇÏ¿© frdr¿¡ ÀúÀå
			FileReader frdr = new FileReader(filename); 

			int c; // ÀÐÀº ¹®ÀÚ¸¦ ÀúÀåÇÏ´Â º¯¼ö´Â int·Î ÇØ¾ß ÆÄÀÏ ³¡ -1À» °Ë»ç °¡´É

			System.out.println("\n  ** " + filename +"¿¡¼­ ÀÐÀº ¹®ÀÚµé **\n");
			
			// FileReader frdr¿¡¼­ ÆÄÀÏÀÇ ³¡±îÁö µ¥ÀÌÅÍ¸¦ ÀÐ¾î È­¸é¿¡ Ãâ·Â
			while((c = frdr.read()) != -1) {
				int ctype = getCharType((char) c);  // ÀÐÀº ¹®ÀÚÀÇ ¹®ÀÚ Á¾·ù ±¸ÇÔ
				countCharTypes[ctype]++;            // ÇØ´ç ¹®ÀÚ Á¾·ùÀÇ ¹®ÀÚ °³¼ö 1 Áõ°¡
				
				System.out.print((char) c);       // ÀÐÀº int °ª c¸¦ ¹®ÀÚ·Î Ãâ·ÂÇÏ±â À§ÇØ Ä³½ºÆ®
			}
			frdr.close();  // FileReader frdrÀ» ´ÝÀ½
		} catch (IOException e) {
			System.out.print("  ??? ¿À·ù: " + e.getMessage());
		}
		
		return countCharTypes;
	}

	// ÁÖ¾îÁø ¹®ÀÚÀÇ ¹®ÀÚ Á¾·ù¸¦ ±¸ÇÏ¿© ¹ÝÈ¯ÇÏ´Â ¸Þ¼Òµå 
	static int getCharType(char c) {
		int ctype;  // 0ºÎÅÍ 8±îÁöÀÇ ¹®ÀÚÁ¾·ù ³ªÅ¸³»´Â ¹øÈ£¸¦ ÀúÀåÇÒ º¯¼ö

		// ¹®ÀÚÁ¾·ù¸¦ È®ÀÎÇÏ¿© ctype¿¡ Á¾·ù¹øÈ£ ÀúÀå
		if (c >= 'A' && c <= 'Z') {           // 'A'ºÎÅÍ 'Z'±îÁö´Â ¿µ´ë¹®ÀÚ
			if (c=='A' || c=='E' || c=='I' || c=='O' || c=='U')  
				ctype = 0;                    //    ¿µ´ë¹®ÀÚ ¸ðÀ½ÀÇ Á¾·ù¹øÈ£: 0
			else
				ctype = 1;                    //    ¿µ´ë¹®ÀÚ ÀÚÀ½ÀÇ Á¾·ù¹øÈ£: 1
		} else if (c >= 'a' && c <= 'z') {    // 'a'ºÎÅÍ 'z'±îÁö´Â ¿µ¼Ò¹®ÀÚ
			if (c=='a' || c=='e' || c=='i' || c=='o' || c=='u')  
				ctype = 2;                    //    ¿µ¼Ò¹®ÀÚ ¸ðÀ½ÀÇ Á¾·ù¹øÈ£: 2
			else
				ctype = 3;                    //    ¿µ¼Ò¹®ÀÚ ÀÚÀ½ÀÇ Á¾·ù¹øÈ£: 3
		} else if (c >= '¤¡' && c <= '¤¾')     // '¤¡'Àº ÇÑ±Û ÀÚÀ½ Áß ÃÖ¼Ò, '¤¾'Àº ÃÖ´ë
			ctype = 4;	                      //     ÇÑ±Û ÀÚÀ½ÀÇ Á¾·ù¹øÈ£: 4
		else if (c >= '¤¿' && c <= '¤Ó')       // '¤¿'´Â ÇÑ±Û ¸ðÀ½ Áß ÃÖ¼Ò, '¤Ó'´Â ÃÖ´ë
			ctype = 5;	                      //     ÇÑ±Û ¸ðÀ½ÀÇ Á¾·ù¹øÈ£: 6 
		else if (c >= '°¡' && c <= 'ÆR')       // '°¡'´Â ÇÑ±Û ±ÛÀÚ Áß ÃÖ¼Ò, 'ÆR'Àº ÃÖ´ë
			ctype = 6;	                      //     ÇÑ±Û ±ÛÀÚÀÇ Á¾·ù¹øÈ£: 6  
		else if (c >= '0' && c <= '9')        // '0'ºÎÅÍ '9'±îÁö´Â µðÁöÆ®
			ctype = 7;                        //     ¼ýÀÚ µðÁöÆ®ÀÇ Á¾·ù¹øÈ£: 7 
		else 
			ctype = 8;                        //     ±âÅ¸ ¹®ÀÚÁ¾·ùÀÇ ¹øÈ£: 8 
 
		return ctype;
	}	

	// int ¹è¿­ countCharTypes¿¡ ÀúÀåµÈ ¹®ÀÚ Á¾·ùº° °³¼ö¸¦ Ãâ·ÂÇÏ´Â ¸Þ¼Òµå
	static void outputCountCharTypes(int[] countCharTypes) {
		System.out.println("\n\n  ** ÀÐÀº ¹®ÀÚµéÀÇ Á¾·ùº° °³¼ö **\n");
		
		for (int i = 0; i < ctypeNames.length; i++)
			System.out.println("  * " + ctypeNames[i] + ": " + countCharTypes[i]);				
	}
}

/*
 * [ ÇÁ·Î±×·¥ ÀÌÇØ ¹× ½ÇÇà ]
 * 
 *   1) ÀÌ ÇÁ·Î±×·¥Àº "java.txt" ÆÄÀÏÀ» ¹®ÀÚ ´ÜÀ§·Î ÀÐ¾î È­¸é¿¡  Ãâ·ÂÇÑ ÈÄ ÇÑ±Û ¹®ÀÚÀÇ °³¼ö¸¦ Ãâ·ÂÇÑ´Ù.
 *      
 *   2) ÇÁ·Î±×·¥À» ½ÇÇàÇÏ¿© Ãâ·Â °á°ú¸¦ È®ÀÎÇÏ¶ó.     
 */
